## Plan Result (543: prod_frontdoor - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 14 to change, 1 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0]
* Update
  * module.premium_front_door.azapi_update_resource.frontdoor_system_identity
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;court-tribunal-hearings-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;court-tribunal-hearings-b2c-staff&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;ejudiciary-home-apex&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;court-tribunal-hearings&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;court-tribunal-hearings-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;ejudiciary-home-apex&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;jd-bureau&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;portal&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;toffee&#34;]
* Replace
  * module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity will be updated in-place
  ~ resource "azapi_update_resource" "frontdoor_system_identity" {
      ~ body                    = jsonencode(
          ~ {
              ~ identity = {
                  ~ type = "None" -> "SystemAssigned"
                }
            }
        )
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
        name                    = "sdshmcts-prod"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["court-tribunal-hearings-b2c-sign-in"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/court-tribunal-hearings-b2c-sign-in"
        name                     = "court-tribunal-hearings-b2c-sign-in"
        # (5 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/secrets/abf3423b-1178-4eb0-9b96-33c7d5144d9f-sign-in-court-tribunal-hearings-service-gov-uk" -> "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/secrets/courttribunalhearingsb2csignin-managed-secret"
          ~ certificate_type        = "ManagedCertificate" -> "CustomerCertificate"
            # (1 unchanged attribute hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["court-tribunal-hearings-b2c-staff"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/court-tribunal-hearings-b2c-staff"
        name                     = "court-tribunal-hearings-b2c-staff"
        # (5 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/secrets/abf3423b-1178-4eb0-9b96-33c7d5144d9f-staff-court-tribunal-hearings-service-gov-uk" -> "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/secrets/courttribunalhearingsb2cstaff-managed-secret"
          ~ certificate_type        = "ManagedCertificate" -> "CustomerCertificate"
            # (1 unchanged attribute hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["ejudiciary-home-apex"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/ejudiciary-home-apex"
        name                     = "ejudiciary-home-apex"
        # (5 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/secrets/abf3423b-1178-4eb0-9b96-33c7d5144d9f-ejudiciary-net" -> "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/secrets/ejudiciaryhomeapex-managed-secret"
          ~ certificate_type        = "ManagedCertificate" -> "CustomerCertificate"
            # (1 unchanged attribute hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["juror-public"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/juror-public"
        name                     = "juror-public"
        # (5 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/secrets/0--4a0ac92a-1cd4-4178-9aa7-c47327622ae1-reply-jury-summons-service-gov-uk" -> "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/secrets/jurorpublic-managed-secret"
          ~ certificate_type        = "ManagedCertificate" -> "CustomerCertificate"
            # (1 unchanged attribute hidden)
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["court-tribunal-hearings"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/court-tribunal-hearings.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_m6jxvnlwdzn71ovzr5jv36cm6ng5tso" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["court-tribunal-hearings-b2c-sign-in"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/court-tribunal-hearings.service.gov.uk/TXT/_dnsauth.sign-in"
        name                = "_dnsauth.sign-in"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "validated" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["darts-portal"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apps.hmcts.net/TXT/_dnsauth.darts"
        name                = "_dnsauth.darts"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_vke28rlel68fcc2e3fkwr6yqwmw2jqu" -> null
        }
      + record {
          + value = "_zlx4bifnd7xod9m46igstsvj07d2pll"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["ejudiciary-home-apex"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/ejudiciary.net/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "validated" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["jd-bureau"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/juror-bureau.justice.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "b0ldj8cnldw9t9wny7jdlky92pm5k33l" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["juror-bureau"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apps.hmcts.net/TXT/_dnsauth.juror"
        name                = "_dnsauth.juror"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_n1p8cty4k8xrz21pvahdowp0s36s0wi" -> null
        }
      + record {
          + value = "l5rlhsc06snj2bz0wt94txdk1r4n0390"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["juror-public"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/reply-jury-summons.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_rgbp065moa1qcb8cim25rrtr7ciuyor" -> null
        }
      + record {
          + value = "_g10se720m77poh8rkmwuqbuw6mupe1b"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["portal"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/pre-recorded-evidence.justice.gov.uk/TXT/_dnsauth.portal"
        name                = "_dnsauth.portal"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_zsxh0l8xlbb4kikhtuxpuojao5t81x6" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["toffee"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.toffee"
        name                = "_dnsauth.toffee"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_lljcwnasgusd351zvmo54mhfcm32r0a" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0] will be created
  + resource "azurerm_key_vault_access_policy" "frontdoor_premium_kv_access" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsprod"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = (known after apply)
    }

  # module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0] must be replaced
-/+ resource "azurerm_role_assignment" "frontdoor_premium_kv_access" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsprod/providers/Microsoft.Authorization/roleAssignments/ee4b3a61-16ef-113f-4738-e0a5d46e1bfd" -> (known after apply)
      ~ name                                   = "ee4b3a61-16ef-113f-4738-e0a5d46e1bfd" -> (known after apply)
      ~ principal_id                           = "5dd7b622-dc97-480b-be3c-c976e8d5659f" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 14 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":981,"Program":"tfcmt","SHA1":"","Target":"543: prod_frontdoor - TerraformPlanApply","Vars":{}} -->